# PanelName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..PanelName Property
ElectricalSystem Class See Also
---
The Panel name of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string PanelName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PanelName As String
	Get
```

Visual C++
---
```text
public:
property String^ PanelName {
	String^ get ();
}
```

# Remarks
This property is used to retrieve the Panel name of the Electrical System.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace